app/views/users/edit.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h1>Editing User</h1>
<% user = User.find(session["warden.user.user.key"][0][0]) %>