app/views/users/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p id="notice"><%= notice %></p>
<% user = User.find(session["warden.user.user.key"][0][0]) %>