app/views/events/edit.html.erb

    <%= form.label :place_id %><br>
    <%= form.collection_select(:place_id, Place.all, :id, :name)%>
---
SELECT "places".* FROM "places"