app/views/events/index.html.erb

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <td><%= event.start_date %></td>
      <td><%= Place.find(event.place_id).name %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---

      <% user = User.find(session["warden.user.user.key"][0][0]) %>