app/views/events/new.html.erb

SELECT "places".* FROM "places"
---
    <%= form.label :place_id %><br>
    <%= form.collection_select(:place_id, Place.all, :id, :name)%>