app/views/events/show.html.erb

<h3><%= @event.start_date %></h3>
<h3><%= Place.find(@event.place_id).name %></h3>
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]


<% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]