app/views/tickets/edit.html.erb

    <%= form.label :event_id %><br>
    <%= form.collection_select(:event_id, Event.all, :id, :name)%>
---
SELECT "events".* FROM "events"