app/views/tickets/index.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <td>$<%= ticket.price %></td>
      <td><%= Event.find(ticket.event_id).name %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

      <% user = User.find(session["warden.user.user.key"][0][0]) %>