app/views/tickets/new.html.erb

SELECT "events".* FROM "events"
---
    <%= form.label :event_id %><br>
    <%= form.collection_select(:event_id, Event.all, :id, :name)%>