app/views/tickets/show.html.erb

<h3>$<%= @ticket.price %></h3>
<h3><%= Event.find(@ticket.event_id).name %></h3>
<% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]