app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (name LIKE '%Event%') ORDER BY id DESC
SELECT "events".* FROM "events"
---
	def index
	  @events = if params[:name]
	    Event.where('name LIKE ?', "%#{params[:name]}%")
	  else
	    Event.all

INSERT INTO "events" ("name", "description", "start_date", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hola"], ["description", ""], ["start_date", "2019-05-26"], ["place_id", 1], ["created_at", "2019-05-23 15:45:30.351300"], ["updated_at", "2019-05-23 15:45:30.351300"]]
---
	def create
		@event = Event.new(event_params)

		if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "Lollapalooza 2019"], ["description", "fff"], ["updated_at", "2019-05-23 15:44:04.967218"], ["id", 1]]
---
	def update
		@event = Event.find(params[:id])

		if @event.update(event_params)