app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE (name LIKE '%T%')
---
	def index
		@places = Place.all

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@place = Place.find(params[:id])

INSERT INTO "places" ("name", "address", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Universidad de los Andes"], ["address", "Avenida Plaza"], ["capacity", 120], ["created_at", "2019-05-23 15:20:14.727650"], ["updated_at", "2019-05-23 15:20:14.727650"]]
---
	def create

		@place = Place.new(place_params)

		if @place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "name" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["name", "EEEEEEEEEEEEEEEEEEEEEE"], ["updated_at", "2019-05-23 15:18:23.377890"], ["id", 1]]
---
	def update
		@place = Place.find(params[:id])

		if @place.update(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "places" WHERE "places"."id" = ?  [["id", 3]]
---
	def destroy
    	@place= Place.find(params[:id])
    	@place.destroy