app/controllers/sessions_controller.rb

	def create
		user = User.where(email: user_params[:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "jatellez@miuandes.cl"], ["LIMIT", 1]]