app/controllers/shopping_bags_controller.rb

SELECT "shopping_bags".* FROM "shopping_bags"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def index
		@shopping_bag = []

		for t in ShoppingBag.all
			ut = UserTicket.find(t.user_ticket)