app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE (description LIKE '%sdjlsla%')
---
	def index
		@tickets = Ticket.all

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def edit
		@ticket = Ticket.find(params[:id])