app/controllers/user_tickets_controller.rb

	def index
		@user_tickets = if params[:time]
	    UserTicket.where('time LIKE ?', "%#{params[:time]}%")
	  else
	    UserTicket.all
---
SELECT "user_tickets".* FROM "user_tickets" WHERE (time LIKE '%2019%')
SELECT "user_tickets".* FROM "user_tickets"

	def show
		@user_ticket = UserTicket.find(params[:id])
---
SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@user_ticket = UserTicket.find(params[:id])
---
SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

	def create
		@ticket = Ticket.find(params[:ticket_id])
		@user_ticket = UserTicket.create(user_id: User.find(session["warden.user.user.key"][0][0]).id, ticket_id: @ticket.id, time: DateTime.now)
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "user_tickets" ("user_id", "ticket_id", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["ticket_id", 1], ["time", "2019-05-24 03:08:33.506511"], ["created_at", "2019-05-24 03:08:33.512020"], ["updated_at", "2019-05-24 03:08:33.512020"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
    	@user_ticket = UserTicket.find(params[:id])
    	@user_ticket.destroy
---
SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "user_tickets" WHERE "user_tickets"."id" = ?  [["id", 12]]

  def index_shopping_bag
		@shopping_bag = []

		for ut in UserTicket.all
			if ut.user_id == User.find(session["warden.user.user.key"][0][0]).id && ut.paid != true
---
SELECT "user_tickets".* FROM "user_tickets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def paid
  	puts "helooooo"
  	@shopping_bag = []

		for ut in UserTicket.all
			if ut.user_id == User.find(session["warden.user.user.key"][0][0]).id && ut.paid != true
				@shopping_bag << ut
			end
		end
	for ut in @shopping_bag
		UserTicket.update(ut.id, :paid => true)
---
SELECT "user_tickets".* FROM "user_tickets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "user_tickets" SET "paid" = ?, "updated_at" = ? WHERE "user_tickets"."id" = ?  [["paid", "t"], ["updated_at", "2019-05-24 03:00:50.242685"], ["id", 14]]