app/views/user_tickets/edit.html.erb

<h1>Edit User Ticket</h1>
<% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]


    <% for ticket in Ticket.all %>
---
SELECT "tickets".* FROM "tickets"

        <td>$<%= ticket.price %></td>
        <td><%= Event.find(ticket.event_id).name %></td>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]