app/views/user_tickets/index.html.erb


    <% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

          <td><%= User.find(user_ticket.user_id).name%></td>
          <td><%= Ticket.find(user_ticket.ticket_id).description %></td>
          <td><%= Event.find(Ticket.find(user_ticket.ticket_id).event_id).name %></td>
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]