app/views/user_tickets/new.html.erb

SELECT "tickets".* FROM "tickets"
---

  <% for ticket in Ticket.all %>

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
      <td>$<%= ticket.price %></td>
      <td><%= Event.find(ticket.event_id).name %></td>