app/views/user_tickets/paid.html.erb

SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <% total += Ticket.find(sb.ticket_id).price %>
      <% user = User.find(session["warden.user.user.key"][0][0]) %>

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= Ticket.find(sb.ticket_id).description%></td>
        <td><%= Event.find(Ticket.find(sb.ticket_id).event_id).name %></td>