app/views/user_tickets/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
<br>
<% user = User.find(session["warden.user.user.key"][0][0]) %>

SELECT  "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	<h2><%= User.find(@user_ticket.user_id).name %></h2>
	<h3><%= Ticket.find(@user_ticket.ticket_id).description %></h3>
	<h3><%= Event.find(Ticket.find(@user_ticket.ticket_id).event_id).name %></h3>