app/views/places/index.html.erb


      <% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]