app/views/places/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h3><%= @place.capacity %></h3>
<% user = User.find(session["warden.user.user.key"][0][0]) %>